# InSessionPrintSetting Properties

---
The InSessionPrintSetting type exposes the following members.
| Name| Description
---|---|---
| PrintParameters| Returns the Parameters of Print Setup.
Top
#### Reference
InSessionPrintSetting Class
Autodesk.Revit.DB Namespace